Ran Plan for 4 projects:

1. dir: `live/atlantis/iam` workspace: `default`
1. dir: `live/dev/iam` workspace: `default`
1. dir: `live/dev/ec2` workspace: `default`
1. dir: `live/qa/ec2` workspace: `default`

### 1. dir: `live/atlantis/iam` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/14 08:33:54 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam] 2020/01/14 08:33:54 Running command: terraform --version
[terragrunt] 2020/01/14 08:33:54 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/SourceAccountIAM. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/14 08:33:54 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/SourceAccountIAM into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/.terragrunt-cache/Nz3skicHKcq2n6iXRIvOkw2K4CA/XPe3XsLpXX7yiTmKxAv3kALkM6g
[terragrunt] 2020/01/14 08:33:54 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/.terragrunt-cache/Nz3skicHKcq2n6iXRIvOkw2K4CA/XPe3XsLpXX7yiTmKxAv3kALkM6g
[terragrunt] 2020/01/14 08:33:54 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/.terragrunt-cache/Nz3skicHKcq2n6iXRIvOkw2K4CA/XPe3XsLpXX7yiTmKxAv3kALkM6g
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam] 2020/01/14 08:33:54 Initializing remote state for the s3 backend
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam] 2020/01/14 08:33:54 Running command: terraform init -backend-config=key=iam/terraform.tfstate -backend-config=region=eu-west-1 -backend-config=bucket=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=dynamodb_table=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=encrypt=true

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.44.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 2.44"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[terragrunt] 2020/01/14 08:33:57 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_iam_policy_document.policy: Refreshing state...
data.aws_iam_policy_document.assume_role_policy: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.sourceaccountrolepolicy will be created
  + resource "aws_iam_policy" "sourceaccountrolepolicy" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "SourceAccountRole"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.sourceaccountrole will be created
  + resource "aws_iam_role" "sourceaccountrole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Managed by Terraform"
      + force_detach_policies = true
      + id                    = (known after apply)
      + max_session_duration  = 36000
      + name                  = "SourceAccountRole"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.sourceaccountrolepolicyattach will be created
  + resource "aws_iam_role_policy_attachment" "sourceaccountrolepolicyattach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SourceAccountRole"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Quoted type constraints are deprecated

  on vars.tf line 7, in variable "name":
   7:   type        = "string"

Terraform 0.11 and earlier required type constraints to be given in quotes,
but that form is now deprecated and will be removed in a future version of
Terraform. To silence this warning, remove the quotes around "string".

(and 4 more similar warnings elsewhere)


------------------------------------------------------------------------

This plan was saved to: /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/default.tfplan"


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>

---
### 2. dir: `live/dev/iam` workspace: `default`
**Plan Error**
```
exit status 1: running "terragrunt plan -no-color -out $PLANFILE" in "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam": 
[terragrunt] 2020/01/14 08:34:00 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/terragrunt.hcl
[terragrunt] 2020/01/14 08:34:00 /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/terragrunt.hcl:42,3-4: Invalid expression; Expected the start of an expression, but found an invalid expression token.
[terragrunt] 2020/01/14 08:34:00 Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 3. dir: `live/dev/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/14 08:34:00 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2] 2020/01/14 08:34:00 Running command: terraform --version
[terragrunt] 2020/01/14 08:34:00 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/14 08:34:00 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/.terragrunt-cache/ErdqrgXWbfRJ5mreRtvcZY9jddk/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 08:34:00 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2 into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/.terragrunt-cache/ErdqrgXWbfRJ5mreRtvcZY9jddk/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 08:34:00 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/.terragrunt-cache/ErdqrgXWbfRJ5mreRtvcZY9jddk/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2] 2020/01/14 08:34:00 Initializing remote state for the s3 backend
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2] 2020/01/14 08:34:01 Running command: terraform init -backend-config=dynamodb_table=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=encrypt=true -backend-config=key=ec2/terraform.tfstate -backend-config=region=eu-west-1 -backend-config=bucket=aws-poc-sparebank1-terragrunt-example-terraform-state-dev

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.44.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 2.44"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[terragrunt] 2020/01/14 08:34:03 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_availability_zones.all: Refreshing state...
data.aws_ami.ubuntu: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.webserver_example will be created
  + resource "aws_autoscaling_group" "webserver_example" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = [
          + "webserver-example-qa",
        ]
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "webserver-example-qa"
        }
    }

  # aws_elb.webserver_example will be created
  + resource "aws_elb" "webserver_example" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = "webserver-example-qa"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:8080/"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 8080
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_launch_configuration.webserver_example will be created
  + resource "aws_launch_configuration" "webserver_example" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0987ee37af7792903"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "4430fd6498339061effa6d27ccf341a1e94569d7"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-asg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.elb will be created
  + resource "aws_security_group" "elb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-elb"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.asg_allow_http_inbound will be created
  + resource "aws_security_group_rule" "asg_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # aws_security_group_rule.elb_allow_all_outbound will be created
  + resource "aws_security_group_rule" "elb_allow_all_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.elb_allow_http_inbound will be created
  + resource "aws_security_group_rule" "elb_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/default.tfplan"


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>

---
### 4. dir: `live/qa/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/14 08:34:07 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2] 2020/01/14 08:34:07 Running command: terraform --version
[terragrunt] 2020/01/14 08:34:07 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/14 08:34:07 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/.terragrunt-cache/Df1CSgdfOPgjThjVvF0oPqVcTs8/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 08:34:07 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2 into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/.terragrunt-cache/Df1CSgdfOPgjThjVvF0oPqVcTs8/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 08:34:07 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/.terragrunt-cache/Df1CSgdfOPgjThjVvF0oPqVcTs8/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2] 2020/01/14 08:34:07 Initializing remote state for the s3 backend
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2] 2020/01/14 08:34:07 Running command: terraform init -backend-config=encrypt=true -backend-config=key=ec2/terraform.tfstate -backend-config=region=eu-west-1 -backend-config=bucket=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=dynamodb_table=aws-poc-sparebank1-terragrunt-example-terraform-state-dev

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.44.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 2.44"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[terragrunt] 2020/01/14 08:34:10 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_availability_zones.all: Refreshing state...
data.aws_ami.ubuntu: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.webserver_example will be created
  + resource "aws_autoscaling_group" "webserver_example" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = [
          + "webserver-example-qa",
        ]
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "webserver-example-qa"
        }
    }

  # aws_elb.webserver_example will be created
  + resource "aws_elb" "webserver_example" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = "webserver-example-qa"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:8080/"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 8080
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_launch_configuration.webserver_example will be created
  + resource "aws_launch_configuration" "webserver_example" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0987ee37af7792903"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "4430fd6498339061effa6d27ccf341a1e94569d7"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-asg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.elb will be created
  + resource "aws_security_group" "elb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-elb"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.asg_allow_http_inbound will be created
  + resource "aws_security_group_rule" "asg_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # aws_security_group_rule.elb_allow_all_outbound will be created
  + resource "aws_security_group_rule" "elb_allow_all_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.elb_allow_http_inbound will be created
  + resource "aws_security_group_rule" "elb_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/default.tfplan"


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>

---

